app/Controllers/Admin/SekolahController.php

    public function edit(string $slug)
    {
        $sekolah = $this->sekolahModel->where('slug', $slug)->first();
---
SELECT *
FROM `sekolah`
WHERE `slug` = 'smp-negeri-1-batusangkarq'
AND `sekolah`.`deleted_at` IS NULL
 LIMIT 1