app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `sekolah`
WHERE `sekolah`.`deleted_at` IS NULL
---
    public function peta(): string
    {
        $sekolahModel = new \App\Models\SekolahModel();
        $total_sekolah = $sekolahModel->countAllResults(false);