app/Models/SekolahModel.php

SELECT `sekolah`.`id`, `nama_sekolah`, `jenjang`, `status`, `akreditasi`, `latitude`, `longitude`, `alamat`, `foto_utama`, `slug`, `statistik_sekolah`.`jumlah_siswa_l`, `statistik_sekolah`.`jumlah_siswa_p`, `statistik_sekolah`.`jumlah_guru_tetap`, `statistik_sekolah`.`jumlah_guru_honor`
FROM `sekolah`
LEFT JOIN `statistik_sekolah` ON `statistik_sekolah`.`sekolah_id` = `sekolah`.`id`
WHERE `sekolah`.`deleted_at` IS NULL
AND `is_active` = 1
---
    public function forPeta(): array
    {
        return $this->select('sekolah.id, nama_sekolah, jenjang, status, akreditasi,
                          sekolah.latitude, sekolah.longitude, alamat, foto_utama, sekolah.slug,
                          sekolah.kecamatan_id, kecamatan.nama_kecamatan,
                          statistik_sekolah.jumlah_siswa_l, statistik_sekolah.jumlah_siswa_p,
                          statistik_sekolah.jumlah_guru_tetap, statistik_sekolah.jumlah_guru_honor')
            ->join('statistik_sekolah', 'statistik_sekolah.sekolah_id = sekolah.id', 'left')
            ->join('kecamatan', 'kecamatan.id = sekolah.kecamatan_id', 'left')
            ->where('sekolah.is_active', 1)
            ->findAll();